var mongoose = require('mongoose'),
    mongoosePaginate = require('mongoose-paginate');

var articleSchema = mongoose.Schema({
    title: {
        type: String,
        validate: function (input) {
            return (input.length > 5 && input.length <= 50);
        },
        required: true,
        require: '{PATH} is required',
        message: '{PATH} title should be between 5 and 25 symbols'
    },
    description: {
        type: String,
        validate: function (input) {
            return (input.length > 100 && input.length <= 3000);
        },
        required: true,
        require: '{PATH} is required',
        message: '{PATH} description should be between 100 and 3000 symbols'
    },
    createdOn: {type: Date, default: Date.now},
    createdBy: {type: String},
    imageUrl: {type: String}
});
articleSchema.plugin(mongoosePaginate);

var Article = mongoose.model('Article', articleSchema);

function articleSeed() {
    Article
        .find({})
        .exec(function (err, collection) {
            if (err) {
                console.log('Cannot find articles...');
                return;
            }

            if (collection.length === 0) {
                Article.create({
                    title: 'Калориен баланс и калориен оптимум',
                    description: 'Тази статия ще ви научи на всичко нужно за изчисляването на хранително меню. Тя няма да го направи по-лесно, а възможно! Разбирането и прилагането на принципите и законите, застъпени в тази статия, прави последната решаваща крачка между начинаещия и средно напредналия фитнес любител по отношение на фитнес диетата. Калориен баланс и калориен оптимум. Калориен баланс - Това е съотношението между количеството енергия, прието с храната от атлета и количеството енергия, изразходвано в тренировки, работа и в битовия живот. За атлета най-важен е ежедневният калориен баланс.Това е съотношението между енергията, получена чрез приетата храна (белтъци, мазнини, въглехидрати и органични киселини), както и чрез алкохола от една страна и изразходваната енергия от друга, за да поддържа биологичния си оптимум (златната среда).',
                    createdBy: 'Anton Hristov',
                    imageUrl: 'http://assets.bb-team.org/content/originals/0914_300.jpg'
                });
                Article.create({
                    title: 'Калориен баланс и калориен оптимум',
                    description: 'Тази статия ще ви научи на всичко нужно за изчисляването на хранително меню. Тя няма да го направи по-лесно, а възможно! Разбирането и прилагането на принципите и законите, застъпени в тази статия, прави последната решаваща крачка между начинаещия и средно напредналия фитнес любител по отношение на фитнес диетата. Калориен баланс и калориен оптимум. Калориен баланс - Това е съотношението между количеството енергия, прието с храната от атлета и количеството енергия, изразходвано в тренировки, работа и в битовия живот. За атлета най-важен е ежедневният калориен баланс.Това е съотношението между енергията, получена чрез приетата храна (белтъци, мазнини, въглехидрати и органични киселини), както и чрез алкохола от една страна и изразходваната енергия от друга, за да поддържа биологичния си оптимум (златната среда).',
                    createdBy: 'Anton Hristov',
                    imageUrl: 'http://assets.bb-team.org/content/originals/0914_300.jpg'
                });
                Article.create({
                    title: 'Калориен баланс и калориен оптимум',
                    description: 'Тази статия ще ви научи на всичко нужно за изчисляването на хранително меню. Тя няма да го направи по-лесно, а възможно! Разбирането и прилагането на принципите и законите, застъпени в тази статия, прави последната решаваща крачка между начинаещия и средно напредналия фитнес любител по отношение на фитнес диетата. Калориен баланс и калориен оптимум. Калориен баланс - Това е съотношението между количеството енергия, прието с храната от атлета и количеството енергия, изразходвано в тренировки, работа и в битовия живот. За атлета най-важен е ежедневният калориен баланс.Това е съотношението между енергията, получена чрез приетата храна (белтъци, мазнини, въглехидрати и органични киселини), както и чрез алкохола от една страна и изразходваната енергия от друга, за да поддържа биологичния си оптимум (златната среда).',
                    createdBy: 'Anton Hristov',
                    imageUrl: 'http://assets.bb-team.org/content/originals/0914_300.jpg'
                });
                Article.create({
                    title: 'Калориен баланс и калориен оптимум',
                    description: 'Тази статия ще ви научи на всичко нужно за изчисляването на хранително меню. Тя няма да го направи по-лесно, а възможно! Разбирането и прилагането на принципите и законите, застъпени в тази статия, прави последната решаваща крачка между начинаещия и средно напредналия фитнес любител по отношение на фитнес диетата. Калориен баланс и калориен оптимум. Калориен баланс - Това е съотношението между количеството енергия, прието с храната от атлета и количеството енергия, изразходвано в тренировки, работа и в битовия живот. За атлета най-важен е ежедневният калориен баланс.Това е съотношението между енергията, получена чрез приетата храна (белтъци, мазнини, въглехидрати и органични киселини), както и чрез алкохола от една страна и изразходваната енергия от друга, за да поддържа биологичния си оптимум (златната среда).',
                    createdBy: 'Anton Hristov',
                    imageUrl: 'http://assets.bb-team.org/content/originals/0914_300.jpg'
                });
                Article.create({
                    title: 'Калориен баланс и калориен оптимум',
                    description: 'Тази статия ще ви научи на всичко нужно за изчисляването на хранително меню. Тя няма да го направи по-лесно, а възможно! Разбирането и прилагането на принципите и законите, застъпени в тази статия, прави последната решаваща крачка между начинаещия и средно напредналия фитнес любител по отношение на фитнес диетата. Калориен баланс и калориен оптимум. Калориен баланс - Това е съотношението между количеството енергия, прието с храната от атлета и количеството енергия, изразходвано в тренировки, работа и в битовия живот. За атлета най-важен е ежедневният калориен баланс.Това е съотношението между енергията, получена чрез приетата храна (белтъци, мазнини, въглехидрати и органични киселини), както и чрез алкохола от една страна и изразходваната енергия от друга, за да поддържа биологичния си оптимум (златната среда).',
                    createdBy: 'Anton Hristov',
                    imageUrl: 'http://assets.bb-team.org/content/originals/0914_300.jpg'
                });
                Article.create({
                    title: 'Калориен баланс и калориен оптимум',
                    description: 'Тази статия ще ви научи на всичко нужно за изчисляването на хранително меню. Тя няма да го направи по-лесно, а възможно! Разбирането и прилагането на принципите и законите, застъпени в тази статия, прави последната решаваща крачка между начинаещия и средно напредналия фитнес любител по отношение на фитнес диетата. Калориен баланс и калориен оптимум. Калориен баланс - Това е съотношението между количеството енергия, прието с храната от атлета и количеството енергия, изразходвано в тренировки, работа и в битовия живот. За атлета най-важен е ежедневният калориен баланс.Това е съотношението между енергията, получена чрез приетата храна (белтъци, мазнини, въглехидрати и органични киселини), както и чрез алкохола от една страна и изразходваната енергия от друга, за да поддържа биологичния си оптимум (златната среда).',
                    createdBy: 'Anton Hristov',
                    imageUrl: 'http://assets.bb-team.org/content/originals/0914_300.jpg'
                });
                Article.create({
                    title: 'Калориен баланс и калориен оптимум',
                    description: 'Тази статия ще ви научи на всичко нужно за изчисляването на хранително меню. Тя няма да го направи по-лесно, а възможно! Разбирането и прилагането на принципите и законите, застъпени в тази статия, прави последната решаваща крачка между начинаещия и средно напредналия фитнес любител по отношение на фитнес диетата. Калориен баланс и калориен оптимум. Калориен баланс - Това е съотношението между количеството енергия, прието с храната от атлета и количеството енергия, изразходвано в тренировки, работа и в битовия живот. За атлета най-важен е ежедневният калориен баланс.Това е съотношението между енергията, получена чрез приетата храна (белтъци, мазнини, въглехидрати и органични киселини), както и чрез алкохола от една страна и изразходваната енергия от друга, за да поддържа биологичния си оптимум (златната среда).',
                    createdBy: 'Anton Hristov',
                    imageUrl: 'http://assets.bb-team.org/content/originals/0914_300.jpg'
                });

                console.log('Articles added to database...');
            }
        });
}

module.exports.seedInitialArticles = function () {
    setTimeout(articleSeed, 1200);
};